app/controllers/places_controller.rb

SELECT "places".* FROM "places" JOIN taggings places_taggings_836d434  ON places_taggings_836d434.taggable_id = "places".id AND places_taggings_836d434.taggable_type = 'Place' AND places_taggings_836d434.tag_id = 2
SELECT "tags".* FROM "tags" WHERE (LOWER(name) = LOWER('schnabel'))
---
  def index
    if params[:tag]
      @places = Place.tagged_with(params[:tag])
    else
      @places = Place.all

SELECT  "places".* FROM "places" WHERE "places"."id" = $1 LIMIT 1  [["id", 3]]
---
  def edit
    @place = Place.find(params[:id])

SELECT  "places".* FROM "places" WHERE "places"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "places" SET "latitude" = $1, "longitude" = $2, "updated_at" = $3 WHERE "places"."id" = $4  [["latitude", 52.514272], ["longitude", 13.4885402], ["updated_at", "2016-04-26 14:04:21.359440"], ["id", 5]]
---
  def update
    @place = Place.find(params[:id])
    @place.update(place_params)

INSERT INTO "places" ("name", "latitude", "longitude", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Test"], ["latitude", 12.0], ["longitude", 52.0], ["created_at", "2016-03-31 15:49:32.755062"], ["updated_at", "2016-03-31 15:49:32.755062"]]
---
  def create
    @place = Place.new(place_params)
    @place.save

SELECT  "places".* FROM "places" WHERE "places"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "places" WHERE "places"."id" = $1  [["id", 1]]
---
  def destroy
    @place = Place.find(params[:id])
    @place.destroy