app/controllers/places_controller.rb

SELECT "places".* FROM "places"
---
  def create
    @place = @map.places.new(@params_to_commit)
    @place.latitude ||= params[:place][:latitude]
    @place.longitude ||= params[:place][:longitude]

    if can_commit_to?(model: @place) && @place.save
      AttributeSetter::Place.set_attributes_after_create(place: @place, params: @params_to_commit, privileged: has_privileged_map_access)
      store_in_session_cookie

      message = @place.reviewed ? t('.created') : t('.preview_mode')
      @place.tweet_place if @place.reviewed

      respond_to do |format|
        format.json do
          render json: {
            places: places_to_show.map(&:geojson),
            coordinates: [@place.latitude, @place.longitude],
            categories: @map.category_names.join(','),
            message: message

SELECT  "places".* FROM "places" WHERE "places"."id" = $1 LIMIT 1  [["id", 3]]
---
  def set_place
    @place = @map.places.find(params[:id])