app/controllers/static_pages_controller.rb

SELECT "places".* FROM "places"
---
  def map
    @categories = Category.all
    @places_total = Place.count
    @announcements = Announcement.all.sort_by(&:created_at).reverse
    places = (Place.reviewed + places_from_session(nil)).uniq
    @last_places_created = places.sort_by(&:created_at).reverse.take(5)