app/views/places/index.html.erb


<script> window.places = <%= @places.map { |p| [p.latitude, p.longitude] } %> </script>
---
SELECT "places".* FROM "places"