app/views/places/index.html.haml

        %td
          - place.tag_list.map do |tag|
---
SELECT "tags".* FROM "tags" WHERE (LOWER(name) = LOWER('schnabel'))